app/channels/application_cable/connection.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def find_verified_user
      if verified_user = User.find_by(id: cookies.encrypted['message_app_session']['user_id'])