lib/tasks/backfill.rake

SELECT "servers".* FROM "servers" ORDER BY "servers"."id" ASC LIMIT $1  [["LIMIT", 1000]]
SELECT "users".* FROM "users" INNER JOIN "server_members" ON "users"."id" = "server_members"."user_id" WHERE "server_members"."server_id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["server_id", 2], ["LIMIT", 1000]]
SELECT 1 AS one FROM "server_read_states" WHERE "server_read_states"."server_id" = $1 AND "server_read_states"."user_id" = $2 LIMIT $3  [["server_id", 2], ["user_id", 2], ["LIMIT", 1]]
INSERT INTO "server_read_states" ("user_id", "server_id", "last_read_at", "unread_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["server_id", 2], ["last_read_at", "2024-11-19 17:14:15.146709"], ["unread_count", 51], ["created_at", "2024-11-19 17:14:15.158507"], ["updated_at", "2024-11-19 17:14:15.158507"]]
SELECT COUNT(*) FROM "messages" WHERE "messages"."server_id" = $1 AND (created_at > $2)  [["server_id", 2], [nil, "2024-11-02 19:06:44.847797"]]
---
  task create_read_states: :environment do
    Server.find_each do |server|
      server.users.find_each do |user|
        next if ServerReadState.exists?(server: server, user: user)

        ServerReadState.create!(
          server: server,
          user: user,
          last_read_at: Time.current,
          unread_count: server.messages.where('created_at > ?', user.created_at).count
        )