app/channels/message_channel.rb

SELECT "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 2], ["id", 3]]
---
  def receive(data)
    parsed_data = data.is_a?(String) ? JSON.parse(data) : data

    server = Server.includes(:users).find(parsed_data['server_id'])

INSERT INTO "messages" ("content", "user_id", "server_id", "parent_message_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "hi"], ["user_id", 3], ["server_id", 2], ["parent_message_id", nil], ["created_at", "2024-11-06 00:15:06.711844"], ["updated_at", "2024-11-06 00:15:06.711844"]]
---
  def handle_create(data, server)
    message = Message.new(
      content: data['content'],
      user: current_user,
      server: server,
      parent_message_id: data['parent_message_id']
    )

    if message.save