app/channels/message_channel.rb

SELECT "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "server_members" ON "users"."id" = "server_members"."user_id" WHERE "server_members"."server_id" = $1  [["server_id", 2]]
SELECT 1 AS one FROM "users" INNER JOIN "server_members" ON "users"."id" = "server_members"."user_id" WHERE "server_members"."server_id" = $1 AND "users"."id" = $2 LIMIT $3  [["server_id", 2], ["id", 3], ["LIMIT", 1]]
SELECT "server_read_states".* FROM "server_read_states" WHERE "server_read_states"."user_id" = $1 AND "server_read_states"."server_id" = $2 LIMIT $3  [["user_id", 3], ["server_id", 2], ["LIMIT", 1]]
---
  def subscribed
    server = Server.find(params[:server_id])
    unless server.users.include?(current_user)
      raise SubscriptionError, 'User not authorized for this server'
    end

    stream_name = "server_#{params[:server_id]}"
    stream_from stream_name

    # Add read state handling
    read_state = server.server_read_states.find_by!(user: current_user)

SELECT "server_read_states".* FROM "server_read_states" WHERE "server_read_states"."user_id" = $1 AND "server_read_states"."server_id" = $2 LIMIT $3  [["user_id", 3], ["server_id", 2], ["LIMIT", 1]]
UPDATE "server_read_states" SET "updated_at" = $1, "last_read_at" = $2 WHERE "server_read_states"."id" = $3  [["updated_at", "2024-11-20 03:27:37.029875"], ["last_read_at", "2024-11-20 03:27:37.029875"], ["id", 2]]
---
  def message_create(data)
    # Update last_read_at whenever a message is created while subscribed
    if @server_id
      read_state = ServerReadState.find_by(user: current_user, server_id: @server_id)
      read_state&.touch(:last_read_at)

SELECT "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 2], ["id", 3]]
SELECT 1 AS one FROM "users" INNER JOIN "server_members" ON "users"."id" = "server_members"."user_id" WHERE "server_members"."server_id" = $1 AND "users"."id" = $2 LIMIT $3  [["server_id", 2], ["id", 2], ["LIMIT", 1]]
---
  def handle_action(handler_class, data)
    parsed_data = data.is_a?(String) ? JSON.parse(data) : data

    server = Server.includes(:users).find(parsed_data['server_id'])
    unless server.users.include?(current_user)