app/channels/notification_channel.rb

  def self.broadcast_to_server(server_id, notification_type, data)
    # Get all users in the server
    server = Server.find(server_id)

    # Broadcast to each user's notification stream
    server.users.each do |user|
---
SELECT "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "server_members" ON "users"."id" = "server_members"."user_id" WHERE "server_members"."server_id" = $1  [["server_id", 2]]