app/channels/message_handlers/message_create_handler.rb

    def call
      message = Message.new(
        content: data['content'],
        user: current_user,
        server: server,
        parent_message_id: data['parent_message_id']
      )

      if message.save
---
INSERT INTO "messages" ("content", "user_id", "server_id", "parent_message_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "hi"], ["user_id", 2], ["server_id", 2], ["parent_message_id", nil], ["created_at", "2024-11-13 22:55:09.306479"], ["updated_at", "2024-11-13 22:55:09.306479"]]