app/channels/message_handlers/reaction_delete_handler.rb

SELECT "messages".* FROM "messages" WHERE "messages"."server_id" = $1 AND "messages"."id" = $2 LIMIT $3  [["server_id", 2], ["id", 41], ["LIMIT", 1]]
DELETE FROM "message_reactions" WHERE "message_reactions"."id" = $1  [["id", 2]]
---
    def call
      message = server.messages.find(data['message_id'])
      reaction = message.reactions.find_by(user: current_user, emoji: data['emoji'])

      if reaction.nil?
        deliver_error_message(message, "Reaction not found")
        return
      end

      if reaction.destroy