app/channels/message_handlers/reaction_create_handler.rb

SELECT "messages".* FROM "messages" WHERE "messages"."server_id" = $1 AND "messages"."id" = $2 LIMIT $3  [["server_id", 2], ["id", 41], ["LIMIT", 1]]
INSERT INTO "message_reactions" ("message_id", "user_id", "emoji", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["message_id", 41], ["user_id", 2], ["emoji", "1f600"], ["created_at", "2024-11-14 00:16:36.512709"], ["updated_at", "2024-11-14 00:16:36.512709"]]
---
    def call

      message = server.messages.find(data['message_id'])

      reaction = message.reactions.create!(
        user: current_user,
        emoji: data['emoji']
      )