app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."server_id" = $1 ORDER BY "messages"."created_at" DESC LIMIT $2 OFFSET $3  [["server_id", 2], ["LIMIT", 50], ["OFFSET", 0]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 2], ["id", 3]]
SELECT COUNT(*) FROM "messages" WHERE "messages"."server_id" = $1  [["server_id", 2]]
---
  def index

    @messages = @server.messages
                      .includes(:user, reactions: { user: {} })
                      .order(created_at: :desc)
                      .page(params[:page])
                      .per(Pagination::DEFAULT_PAGE_SIZE)

    # Add debug information to the response
    render json: {
      messages: @messages.as_json(message_includes),
      pagination: {
        current_page: @messages.current_page,
        total_pages: @messages.total_pages,
        total_count: @messages.total_count,
        next_page: @messages.next_page,
        prev_page: @messages.prev_page,
        per_page: Pagination::DEFAULT_PAGE_SIZE,
        actual_size: @messages.size # This will show us how many records are actually being returned

SELECT "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_server
    @server = Server.find(params[:server_id])

SELECT 1 AS one FROM "users" INNER JOIN "server_members" ON "users"."id" = "server_members"."user_id" WHERE "server_members"."server_id" = $1 AND "users"."id" = $2 LIMIT $3  [["server_id", 2], ["id", 2], ["LIMIT", 1]]
---
  def is_member_of_server?
    unless @server.users.include?(@current_user)