app/controllers/servers_controller.rb

SELECT "servers".* FROM "servers"
---
  def index
    @servers = Server.all

INSERT INTO "servers" ("name", "description", "created_at", "updated_at", "owner_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Carlo's Room"], ["description", "my first server"], ["created_at", "2024-11-02 19:37:55.355479"], ["updated_at", "2024-11-02 19:37:55.355479"], ["owner_id", 2]]
INSERT INTO "servers" ("name", "description", "created_at", "updated_at", "owner_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Secret room"], ["description", "My second server"], ["created_at", "2024-11-06 03:14:44.158793"], ["updated_at", "2024-11-06 03:14:44.158793"], ["owner_id", 2]]
---
  def create
    @server = Server.new(server_params)
    @server.users << @current_user
    @server.owner_id = @current_user.id

    if @server.save

SELECT "users".* FROM "users" INNER JOIN "server_members" ON "users"."id" = "server_members"."user_id" WHERE "server_members"."server_id" = $1  [["server_id", 2]]
SELECT 1 AS one FROM "users" INNER JOIN "server_members" ON "users"."id" = "server_members"."user_id" WHERE "server_members"."server_id" = $1 AND "users"."id" = $2 LIMIT $3  [["server_id", 2], ["id", 3], ["LIMIT", 1]]
---
  def leave
    if @server.owner_id == @current_user.id
      render json: { message: "Cannot leave server that you own" }, status: :unauthorized

    elsif !@server.users.include?(@current_user)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" INNER JOIN "server_members" ON "users"."id" = "server_members"."user_id" WHERE "server_members"."server_id" = $1 AND "users"."id" = $2 LIMIT $3  [["server_id", 2], ["id", 3], ["LIMIT", 1]]
UPDATE "servers" SET "updated_at" = $1, "owner_id" = $2 WHERE "servers"."id" = $3  [["updated_at", "2024-11-02 20:01:46.130010"], ["owner_id", 3], ["id", 2]]
---
  def transfer_ownership
    new_owner = User.find(params[:owner_id])

    if !@server.users.include?(new_owner)
      render json: { message: "User is not a member of this server" }, status: :unauthorized
    else
      @server.update(owner_id: new_owner.id)

SELECT "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_server
      @server = Server.find(params[:id])

SELECT 1 AS one FROM "users" INNER JOIN "server_members" ON "users"."id" = "server_members"."user_id" WHERE "server_members"."server_id" = $1 AND "users"."id" = $2 LIMIT $3  [["server_id", 2], ["id", 3], ["LIMIT", 1]]
---
    def is_member_of_server?
      unless @server.users.include?(@current_user)