app/controllers/servers_controller.rb

SELECT "servers".* FROM "servers" INNER JOIN "server_members" ON "servers"."id" = "server_members"."server_id" WHERE "server_members"."user_id" = $1  [["user_id", 2]]
SELECT "server_read_states".* FROM "server_read_states" WHERE "server_read_states"."server_id" = $1 AND "server_read_states"."user_id" = $2 LIMIT $3  [["server_id", 2], ["user_id", 2], ["LIMIT", 1]]
---
  def show
    read_state = @server.server_read_states.find_by(user: @current_user)

SELECT "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_server
      @server = Server.find(params[:id])

SELECT 1 AS one FROM "users" INNER JOIN "server_members" ON "users"."id" = "server_members"."user_id" WHERE "server_members"."server_id" = $1 AND "users"."id" = $2 LIMIT $3  [["server_id", 2], ["id", 2], ["LIMIT", 1]]
---
    def is_member_of_server?
      unless @server.users.include?(@current_user)