app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("username", "email", "is_active", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "user1"], ["email", "[FILTERED]"], ["is_active", nil], ["created_at", "2024-11-02 19:00:41.095232"], ["updated_at", "2024-11-02 19:00:41.095232"], ["password_digest", "[FILTERED]"]]

  def show
    if @current_user
      read_states = ServerReadState.where(user: @current_user, server: @current_user.servers)
                                 .index_by(&:server_id)

      servers_with_messages = @current_user.servers.map do |server|
        read_state = read_states[server.id]
        server.as_json.merge(
          latest_message: server.messages.order(created_at: :desc).first&.as_json(include: { user: { only: :username } }),
          read_state: {
            last_read_at: read_state&.last_read_at,
            unread_count: read_state&.unread_count || 0
          }
        )
---
SELECT "server_read_states".* FROM "server_read_states" WHERE "server_read_states"."server_id" = $1 AND "server_read_states"."user_id" = $2 LIMIT $3  [["server_id", 2], ["user_id", 2], ["LIMIT", 1]]
SELECT "servers".* FROM "servers" INNER JOIN "server_members" ON "servers"."id" = "server_members"."server_id" WHERE "server_members"."user_id" = $1  [["user_id", 2]]
SELECT "servers".* FROM "servers" INNER JOIN "server_members" ON "servers"."id" = "server_members"."server_id" WHERE "server_members"."user_id" = $1  [["user_id", 3]]
SELECT "messages".* FROM "messages" WHERE "messages"."server_id" = $1 ORDER BY "messages"."created_at" DESC LIMIT $2  [["server_id", 2], ["LIMIT", 1]]