app/models/message.rb

SELECT "server_read_states".* FROM "server_read_states" WHERE "server_read_states"."server_id" = $1 AND "server_read_states"."user_id" != $2  [["server_id", 2], ["user_id", 3]]
UPDATE "server_read_states" SET "updated_at" = $1, "last_read_at" = $2 WHERE "server_read_states"."id" = $3  [["updated_at", "2024-11-20 03:20:04.630512"], ["last_read_at", "2024-11-20 03:20:04.630512"], ["id", 1]]
---
  def increment_unread_counts
    # Get all read states for users in this server except the message sender
    read_states = server.server_read_states.where.not(user_id: user_id)

    # Get subscribed user IDs from MessageChannel
    subscribed_user_ids = ActionCable.server.connections.map(&:current_user).compact.map(&:id)

    # Only increment unread count for users not currently subscribed
    read_states.each do |read_state|
      if subscribed_user_ids.include?(read_state.user_id)
        # Just update last_read_at for subscribed users
        read_state.touch(:last_read_at)